tap "yandex/arc", "https://arc.yandex.net/arcadia/homebrew-devtools"
tap "hashicorp/tap"

brew "bat"
brew "bison"
brew "brotli"
brew "cmake"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "eza"
brew "fd"
brew "flex"
brew "fzf"
brew "gh"
brew "go"
brew "jq"
brew "libpcap"
brew "libssh2"
brew "llvm"
brew "llvm@14"
brew "md5sha1sum"
brew "mingw-w64"
brew "neovim"
brew "nvm"
brew "pipx"
brew "pnpm"
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "pure"
brew "python@3.13"
brew "pyenv"
brew "ripgrep"
brew "sd"
brew "starship"
brew "hashicorp/tap/terraform"
brew "ugrep"
brew "yandex/arc/arc-launcher"
brew "yq"
brew "zsh-syntax-highlighting"

cask "font-fira-code"
cask "ghostty"
cask "hyper"
cask "macfuse"
cask "notunes"
cask "xquartz"
